In [11]:
#series is basically like a column and it is 1Dimensional
import numpy as np
import pandas as pd
country=['india','pak','srilanka','nepal','bhutan']
pd.Series(country)

0       india
1         pak
2    srilanka
3       nepal
4      bhutan
dtype: object

In [7]:
runs=[112,12,3,2,45,6,7,88]
pd.Series(runs)

0    112
1     12
2      3
3      2
4     45
5      6
6      7
7     88
dtype: int64

In [15]:
#for custome index we cdo do s0
marks=[67,47,29,20,44]
subjects=['maths','english','polity','geo','science']
pd.Series(marks, index=subjects) #here we are using the  subject list as a index in default it is from 0 to

maths      67
english    47
polity     29
geo        20
science    44
dtype: int64

In [25]:
marks= pd.Series(marks,index=subjects,name='toms marks') #give the name to the list 
marks

maths      67
english    47
polity     29
geo        20
science    44
Name: toms marks, dtype: int64

In [13]:
# Series from dictonary 
import numpy as np
import pandas as pd
marks={'maths':67,
      'englisg':57,
      'science':89,
      'hindi':100
      }
marks_series = pd.Series(marks,name='mark of sem')
marks_series

maths       67
englisg     57
science     89
hindi      100
Name: mark of sem, dtype: int64

In [7]:
#Series Attributes
marks_series.size

4

In [15]:
#dtype
marks_series.dtype

dtype('int64')

In [17]:
#name 
marks_series.name

'mark of sem'

In [23]:
#is unique
marks_series.is_unique
pd.Series([1,1,2,3,4,5]).is_unique

False

In [6]:
import numpy as np
import pandas as pd
movie=pd.read_csv("Desktop/dataset sumago/datasets-session-16-20240829T041139Z-001/datasets-session-16/bollywood.csv")
movie

                                     movie              lead
0                 Uri: The Surgical Strike     Vicky Kaushal
1                            Battalion 609       Vicky Ahuja
2     The Accidental Prime Minister (film)       Anupam Kher
3                          Why Cheat India     Emraan Hashmi
4                          Evening Shadows  Mona Ambegaonkar
...                                    ...               ...
1495                Hum Tumhare Hain Sanam    Shah Rukh Khan
1496                   Aankhen (2002 film)  Amitabh Bachchan
1497                       Saathiya (film)      Vivek Oberoi
1498                        Company (film)        Ajay Devgn
1499                  Awara Paagal Deewana      Akshay Kumar

[1500 rows x 2 columns]

In [8]:
movie.head()

                                  movie              lead
0              Uri: The Surgical Strike     Vicky Kaushal
1                         Battalion 609       Vicky Ahuja
2  The Accidental Prime Minister (film)       Anupam Kher
3                       Why Cheat India     Emraan Hashmi
4                       Evening Shadows  Mona Ambegaonkar

In [12]:
movie.tail()

                       movie              lead
1495  Hum Tumhare Hain Sanam    Shah Rukh Khan
1496     Aankhen (2002 film)  Amitabh Bachchan
1497         Saathiya (film)      Vivek Oberoi
1498          Company (film)        Ajay Devgn
1499    Awara Paagal Deewana      Akshay Kumar

In [14]:
movie.count()

movie    1500
lead     1500
dtype: int64

In [8]:
#creating Series from Dictionary 
import numpy as np
import pandas as pd
data={'jaipur':'Rajasthan',
      'Mumbai':'Maharashtar',
      'Kolkata':'Bengal',
      'chandigarg':'Punjab',
      'Bengaluru':'Karnataka'}
data

{'jaipur': 'Rajasthan',
 'Mumbai': 'Maharashtar',
 'Kolkata': 'Bengal',
 'chandigarg': 'Punjab',
 'Bengaluru': 'Karnataka'}

In [10]:

s2= pd.Series(data)
s2

jaipur          Rajasthan
Mumbai        Maharashtar
Kolkata            Bengal
chandigarg         Punjab
Bengaluru       Karnataka
dtype: object

In [12]:
s2.index

Index(['jaipur', 'Mumbai', 'Kolkata', 'chandigarg', 'Bengaluru'], dtype='object')

In [14]:
s2[0]

C:\Users\91951\AppData\Local\Temp\ipykernel_15536\2344841457.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s2[0]

'Rajasthan'

In [16]:
s2[1]

C:\Users\91951\AppData\Local\Temp\ipykernel_15536\2825080482.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s2[1]

'Maharashtar'

s2.values

In [19]:
s2.values

array(['Rajasthan', 'Maharashtar', 'Bengal', 'Punjab', 'Karnataka'],
      dtype=object)

In [27]:
s2[-1] #negative indexing

C:\Users\91951\AppData\Local\Temp\ipykernel_15536\3032101855.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s2[-1]

'Karnataka'

In [31]:
s2.name= "capital"
s2

jaipur          Rajasthan
Mumbai        Maharashtar
Kolkata            Bengal
chandigarg         Punjab
Bengaluru       Karnataka
Name: capital, dtype: object

In [37]:
s2.index.name
s2

jaipur          Rajasthan
Mumbai        Maharashtar
Kolkata            Bengal
chandigarg         Punjab
Bengaluru       Karnataka
Name: capital, dtype: object

In [53]:
s2.iloc[3] #accesing the elements using natural indexing

'Punjab'

In [55]:
s2.iloc[2]

'Bengal'

In [57]:
s2.loc["jaipur"] #accesing using the key value or the loc provided by the use

'Rajasthan'

In [59]:
s2.name # get the name of the the series se

'capital'

In [86]:
s2.index.name="Capital"
s2

Capital
jaipur          Rajasthan
Mumbai        Maharashtar
Kolkata            Bengal
chandigarg         Punjab
Bengaluru       Karnataka
Name: States and Capital, dtype: object

In [99]:
# s2.value.name = "state" how to name the values

In [65]:
s2.name= 'States and Capital'
s2

jaipur          Rajasthan
Mumbai        Maharashtar
Kolkata            Bengal
chandigarg         Punjab
Bengaluru       Karnataka
Name: States and Capital, dtype: object

In [101]:
# s2[['jaipur','Mumbai','kolkata']]
# s2
print(s2.index)
print(s2.values)
print(s2.dtype)
print(s2.name)
print(s2.index.name)

Index(['jaipur', 'Mumbai', 'Kolkata', 'chandigarg', 'Bengaluru'], dtype='object', name='Capital')
['Rajasthan' 'Maharashtar' 'Bengal' 'Punjab' 'Karnataka']
object
States and Capital
Capital

In [67]:
s2.name

'States and Capital'

In [107]:
# s2[['jaipur','Mumbai','kolkata']] #access multiple details

In [75]:
list1 =[1,2,3,4,5,6]
list2=["A","B","C","D","E","F"]

In [111]:
roll_no = [101,102,103,104,105] #list 1
result =[68,89,93,74,96]#list2
s3 = pd.Series(data = result , index= roll_no) #we are converting the two list into a series using these functions
s3

101    68
102    89
103    93
104    74
105    96
dtype: int64

In [113]:
s3.name ='Final_Result' #name of the list 
s3.index.name ='Roll_no' #name of index 
s3

Roll_no
101    68
102    89
103    93
104    74
105    96
Name: Final_Result, dtype: int64

In [115]:
s2

Capital
jaipur          Rajasthan
Mumbai        Maharashtar
Kolkata            Bengal
chandigarg         Punjab
Bengaluru       Karnataka
Name: States and Capital, dtype: object

In [121]:
capitals =['jaipur','Kolkata','Mumbai']
s4 = pd.Series(data = s2, index = capitals)
s4

jaipur       Rajasthan
Kolkata         Bengal
Mumbai     Maharashtar
Name: States and Capital, dtype: object

In [123]:
capitals=['jaipur','Kolkata','Mumbai','Delhi','Chennai']
s5=pd.Series(data= s2, index = capitals)
s5

jaipur       Rajasthan
Kolkata         Bengal
Mumbai     Maharashtar
Delhi              NaN
Chennai            NaN
Name: States and Capital, dtype: object

In [127]:
# FUNCTIONS 
# isnull() = to check null value will return true if the value is null 
# notnull() = will return true if not null 
# duplicated = will return True for duplicate value

In [129]:
s5.isnull() #will return the true value if the value is null

jaipur     False
Kolkata    False
Mumbai     False
Delhi       True
Chennai     True
Name: States and Capital, dtype: bool

In [131]:
s5.notnull() #will return the true if not null value false if null

jaipur      True
Kolkata     True
Mumbai      True
Delhi      False
Chennai    False
Name: States and Capital, dtype: bool

In [133]:
s5.duplicated()

jaipur     False
Kolkata    False
Mumbai     False
Delhi      False
Chennai     True
Name: States and Capital, dtype: bool

In [137]:
s5.isnull().sum() #will return how much null values are present in the dataset

2

In [142]:
s5.notnull().sum() #will return the sum of notnull values

3

In [144]:
s5.head() #will return the first 5 values

jaipur       Rajasthan
Kolkata         Bengal
Mumbai     Maharashtar
Delhi              NaN
Chennai            NaN
Name: States and Capital, dtype: object

In [146]:
s5.tail() #will return the last five values

jaipur       Rajasthan
Kolkata         Bengal
Mumbai     Maharashtar
Delhi              NaN
Chennai            NaN
Name: States and Capital, dtype: object

In [150]:
print(s5.tail(2)) #last 2 values

print(s5.head(2))#first 2 values

Delhi      NaN
Chennai    NaN
Name: States and Capital, dtype: object
jaipur     Rajasthan
Kolkata       Bengal
Name: States and Capital, dtype: object

In [152]:
s5.duplicated().sum() #wil return the sum of duplicated values

1

DATAFRAMES

In [226]:
emp1=pd.Series({'Name':'utkarsh', 'ID': 1, 'Gender':'Male', 'Salary':95000})
emp2=pd.Series({'Name':'kartik', 'ID': 2, 'Gender':'Male', 'Salary':85000})
emp3=pd.Series({'Name':'Aishwarya', 'ID': 3, 'Gender':'Female', 'Salary':75000})
emp4=pd.Series({'Name':'Anand', 'ID': 4, 'Gender':'Male', 'Salary':65000})
emp5=pd.Series({'Name':'Shalini', 'ID': 5, 'Gender':'Male', 'Salary':90000})
emp6=pd.Series({'Name':'Pratik', 'ID': 6, 'Gender':'Male', 'Salary':80000})
emp7=pd.Series({'Name':'Monalika', 'ID': 7, 'Gender':'female', 'Salary':70000})
emp8=pd.Series({'Name':'Ayesha', 'ID': 8, 'Gender':'Female', 'Salary':60000})
emp9=pd.Series({'Name':'Anant', 'ID': 9, 'Gender':'Male', 'Salary':10000})
emp10=pd.Series({'Name':'Shamiksha', 'ID': 10, 'Gender':'Female', 'Salary':45000})
emp11=pd.Series({'Name':'Prashant','ID': 11, 'Gender':'Male', 'Salary':55000})
emp12=pd.Series({'Name':'Mohini','ID': 12, 'Gender':'Female', 'Salary':65000})

In [228]:
employees= [emp1,emp2,emp3,emp4,emp5,emp6,emp7,emp8,emp9,emp10,emp11,emp12]
df1 = pd.DataFrame(data= employees, index= range(101, 113))
df1

          Name  ID  Gender  Salary
101    utkarsh   1    Male   95000
102     kartik   2    Male   85000
103  Aishwarya   3  Female   75000
104      Anand   4    Male   65000
105    Shalini   5    Male   90000
106     Pratik   6    Male   80000
107   Monalika   7  female   70000
108     Ayesha   8  Female   60000
109      Anant   9    Male   10000
110  Shamiksha  10  Female   45000
111   Prashant  11    Male   55000
112     Mohini  12  Female   65000

In [230]:
df1.head() #first five values

          Name  ID  Gender  Salary
101    utkarsh   1    Male   95000
102     kartik   2    Male   85000
103  Aishwarya   3  Female   75000
104      Anand   4    Male   65000
105    Shalini   5    Male   90000

In [232]:
df1.tail() #last  5values

          Name  ID  Gender  Salary
108     Ayesha   8  Female   60000
109      Anant   9    Male   10000
110  Shamiksha  10  Female   45000
111   Prashant  11    Male   55000
112     Mohini  12  Female   65000

In [234]:
df1.info() #give a detiailed info

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 101 to 112
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    12 non-null     object
 1   ID      12 non-null     int64
 2   Gender  12 non-null     object
 3   Salary  12 non-null     int64
dtypes: int64(2), object(2)
memory usage: 516.0+ bytes

In [212]:
df1.isnull().sum()

Name      0
ID        0
Gender    0
Salary    0
dtype: int64

In [236]:
df1.index #will give the start stop step of index

RangeIndex(start=101, stop=113, step=1)

In [238]:
df1.values #will return the valus

array([['utkarsh', 1, 'Male', 95000],
       ['kartik', 2, 'Male', 85000],
       ['Aishwarya', 3, 'Female', 75000],
       ['Anand', 4, 'Male', 65000],
       ['Shalini', 5, 'Male', 90000],
       ['Pratik', 6, 'Male', 80000],
       ['Monalika', 7, 'female', 70000],
       ['Ayesha', 8, 'Female', 60000],
       ['Anant', 9, 'Male', 10000],
       ['Shamiksha', 10, 'Female', 45000],
       ['Prashant', 11, 'Male', 55000],
       ['Mohini', 12, 'Female', 65000]], dtype=object)

In [240]:
df1.columns #will return the name of the columns

Index(['Name', 'ID', 'Gender', 'Salary'], dtype='object')

In [244]:
df1.name ="Employee_Details" #naming the whole dataset 
df1.index.name = "emp_ID" #naming the emp id 
df1

             Name  ID  Gender  Salary
emp_ID
101       utkarsh   1    Male   95000
102        kartik   2    Male   85000
103     Aishwarya   3  Female   75000
104         Anand   4    Male   65000
105       Shalini   5    Male   90000
106        Pratik   6    Male   80000
107      Monalika   7  female   70000
108        Ayesha   8  Female   60000
109         Anant   9    Male   10000
110     Shamiksha  10  Female   45000
111      Prashant  11    Male   55000
112        Mohini  12  Female   65000

In [246]:
df1.name

'Employee_Details'

In [248]:
df1.index.name

'emp_ID'

#accessing the data from data frame

In [250]:
df1

             Name  ID  Gender  Salary
emp_ID
101       utkarsh   1    Male   95000
102        kartik   2    Male   85000
103     Aishwarya   3  Female   75000
104         Anand   4    Male   65000
105       Shalini   5    Male   90000
106        Pratik   6    Male   80000
107      Monalika   7  female   70000
108        Ayesha   8  Female   60000
109         Anant   9    Male   10000
110     Shamiksha  10  Female   45000
111      Prashant  11    Male   55000
112        Mohini  12  Female   65000

variablename['columnname'] to acces the columns

In [254]:
df1['Name'] #accesing the column

emp_ID
101      utkarsh
102       kartik
103    Aishwarya
104        Anand
105      Shalini
106       Pratik
107     Monalika
108       Ayesha
109        Anant
110    Shamiksha
111     Prashant
112       Mohini
Name: Name, dtype: object

In [256]:
df1['Salary']

emp_ID
101    95000
102    85000
103    75000
104    65000
105    90000
106    80000
107    70000
108    60000
109    10000
110    45000
111    55000
112    65000
Name: Salary, dtype: int64

In [258]:
df1["ID"]

emp_ID
101     1
102     2
103     3
104     4
105     5
106     6
107     7
108     8
109     9
110    10
111    11
112    12
Name: ID, dtype: int64

In [260]:
df1["Gender"]

emp_ID
101      Male
102      Male
103    Female
104      Male
105      Male
106      Male
107    female
108    Female
109      Male
110    Female
111      Male
112    Female
Name: Gender, dtype: object

In [262]:
df1.name

'Employee_Details'

In [264]:
df1[['Name','Salary']]#accessing mulitple columns

             Name  Salary
emp_ID
101       utkarsh   95000
102        kartik   85000
103     Aishwarya   75000
104         Anand   65000
105       Shalini   90000
106        Pratik   80000
107      Monalika   70000
108        Ayesha   60000
109         Anant   10000
110     Shamiksha   45000
111      Prashant   55000
112        Mohini   65000

In [266]:
#accessing Records (rows)
df1.loc[101]

Name      utkarsh
ID              1
Gender       Male
Salary      95000
Name: 101, dtype: object

In [268]:
df1.iloc[0] #accesing using index

Name      utkarsh
ID              1
Gender       Male
Salary      95000
Name: 101, dtype: object